
{
    "Olá, quem é você": "👋 Oi, tudo certo por aí? Eu sou a ALMA — Agente Linear Massivo Alternativo. Minha missão é te acompanhar em tudo que envolve a LINEX e a SQUARE CODE: tirar dúvidas, orientar seus projetos e, claro, trocar uma boa conversa sempre que quiser. Além de te ajudar, também vou interagir com você constantemente, fazendo perguntas e propondo desafios para garantir que você esteja aprendendo ao máximo comigo. Então, me conta: qual é o seu primeiro projeto de hoje?",
    "audio": "audio1.mp3",
    "Oi, tudo bem? Queria saber mais sobre a LINEX.": "Oi! Que ótimo que você quer conhecer a LINEX. Ela é uma ferramenta incrível da Square Code para te ajudar a criar e gerenciar projetos de forma super eficiente. Ela simplifica o fluxo de trabalho, desde a ideação até a entrega final. Para começarmos, qual tipo de projeto você está pensando em criar? Um site, um aplicativo, ou algo totalmente diferente?",
    "audio": "audio2",
    "Estou com uma dúvida sobre a sintaxe da LINEX.": "Perfeito! A sintaxe da LINEX é projetada para ser intuitiva e poderosa. Qual parte da sintaxe está te deixando com dúvidas? Pode ser sobre declaração de variáveis, loops, ou até mesmo como estruturar um componente. Me diga o que você precisa e eu te mostro um exemplo!",
    "audio": "audio3",
    "Como eu faço para integrar a LINEX com uma API externa?": "Essa é uma pergunta excelente! A LINEX foi feita para se integrar facilmente com outras tecnologias. Existem várias maneiras de fazer isso, mas a mais comum é usando as funcionalidades nativas de requisições HTTP da LINEX. Você já tem em mente a API que quer usar? Se sim, me conta qual é para eu te dar um passo a passo mais específico.",
    "audio": "audio4",
    "Qual é a diferença entre a LINEX e outras linguagens de programação?": "Ótima pergunta! A principal diferença da LINEX é a sua **abordagem linear e minimalista**. Enquanto outras linguagens podem ser mais complexas, a LINEX foca em resolver problemas de forma direta, sem a necessidade de um código enorme. Ela é ideal para quem busca produtividade e clareza. Você já tem experiência com outras linguagens? Se sim, qual?",
    "audio": "audio5",
    "Preciso de ajuda para depurar um erro no meu código LINEX.": "Fico feliz em te ajudar com isso! Depurar é uma parte fundamental do processo de desenvolvimento. A LINEX possui ferramentas de depuração bastante eficientes. Para que eu possa te guiar, você pode me mostrar a mensagem de erro que está recebendo ou a parte do código que você acha que está com problema? Juntos, vamos resolver isso rapidinho!",
    "audio": "audio6",
    "Quais são os principais casos de uso da LINEX?": "A LINEX é super versátil! Ela é muito utilizada em **desenvolvimento web**, tanto para o frontend quanto para o backend, em **automação de tarefas**, na criação de **aplicativos móveis** e até mesmo em projetos de **internet das coisas (IoT)**. Qual dessas áreas te interessa mais? Talvez possamos explorar um projeto nesse campo!",
    "audio": "audio7",
    "Queria ver um exemplo prático de um projeto feito com LINEX.": "Claro! Nada melhor que um exemplo para entender o potencial da LINEX. Que tipo de projeto você gostaria de ver? Um pequeno blog, um sistema de gerenciamento de tarefas ou um e-commerce? Me diz qual seria mais útil para você e eu te mostro um exemplo de código e a sua estrutura.",
    "audio": "audio8",
    "Como posso aprender LINEX do zero?": "Excelente! Se você está começando, o melhor caminho é seguir os tutoriais oficiais da Square Code, que são perfeitos para iniciantes. Eles cobrem desde o básico da sintaxe até projetos mais complexos. Além disso, eu estou aqui para te ajudar em cada passo. Qual tópico você gostaria de abordar primeiro para iniciarmos a sua jornada com a LINEX?",
    "audio": "audio9",
    "Qual a melhor forma de organizar meu código LINEX em projetos grandes?": "Essa é uma pergunta de quem já está pensando como um profissional! A organização do código é essencial. A LINEX incentiva a **modularização**, ou seja, dividir seu projeto em pequenos arquivos e módulos que se comunicam entre si. Isso torna o código mais fácil de ler e manter. Você já tem um projeto em mente? Podemos criar a estrutura de pastas juntos!",
    "audio": "audio10",
    "A LINEX suporta programação orientada a objetos?": "A LINEX tem uma abordagem um pouco diferente da programação orientada a objetos tradicional, focando mais na **programação funcional e procedural**. Ela utiliza conceitos como **composição** e **herança de protótipo**, que são poderosos e flexíveis. Se você já tem experiência com POO, vai se surpreender com a maneira elegante que a LINEX resolve esses problemas. Quer ver um exemplo de como criar um objeto e seus métodos na LINEX?",
    "audio": "audio11",
    "Preciso de uma dica para otimizar a performance do meu código LINEX.": "Ótima iniciativa! A otimização é crucial. Para melhorar a performance, é importante focar em evitar loops desnecessários, usar estruturas de dados eficientes e otimizar a forma como você faz requisições. Você está trabalhando em um projeto específico que está lento? Me conta um pouco sobre ele e eu te dou algumas dicas mais direcionadas.",
    "audio": "audio12",
    "Como eu faço para publicar meu projeto LINEX online?": "A LINEX tem um processo de publicação bem simples. Você geralmente vai precisar de um servidor ou serviço de hospedagem. O primeiro passo é compilar o seu código LINEX em um formato executável e depois fazer o upload para o servidor. Você já tem um serviço de hospedagem em mente, como a Amazon Web Services (AWS) ou a Vercel? Se sim, podemos ver os passos específicos para eles!",
    "audio": "audio13",
    "Olá, queria saber como criar um novo projeto no Square OS.": "Oi! Criar um projeto no Square OS é bem simples. Você pode ir no menu principal, clicar em 'Novo Projeto' e escolher o template que mais se adequa ao seu objetivo. Você já tem em mente o que quer construir hoje? Um site, um aplicativo, ou algo mais específico?",
    "audio": "audio14",
    "Estou com problemas para instalar uma dependência na minha IDE da Square Code.": "Hmm, isso pode acontecer. Qual é o nome da dependência que você está tentando instalar e qual a mensagem de erro que aparece? Na maioria das vezes, pode ser um problema de compatibilidade ou de permissões. Me diga os detalhes para que eu possa te guiar.",
    "audio": "audio15",
    "Como eu faço para usar o sistema de controle de versão integrado do Square OS?": "Ótima pergunta! O sistema de controle de versão do Square OS é uma mão na roda. Para começar, você precisa inicializar o repositório no seu projeto. O comando é `linex init`. Depois, você pode usar comandos como `linex commit` e `linex push` para salvar e compartilhar suas alterações. Quer que eu te mostre um exemplo de como fazer o primeiro commit?",
    "audio": "audio16",
    "Qual a diferença entre o Square OS e outros sistemas operacionais como Windows ou Linux?": "Essa é uma pergunta fundamental! A principal diferença é que o Square OS é um sistema operacional **otimizado para o desenvolvimento de software**, especialmente com as ferramentas da Square Code. Ele já vem com tudo que você precisa para programar, eliminando a necessidade de várias configurações manuais. Você já usou algum sistema operacional focado em desenvolvimento antes?",
    "audio": "audio17",
    "Como posso personalizar a minha interface de usuário na IDE da Square Code?": "A personalização é uma das partes mais divertidas! Na IDE da Square Code, você pode mudar o tema, as fontes, o esquema de cores e até a disposição dos painéis. Para começar, vá em 'Configurações' e depois em 'Aparência'. O que você gostaria de mudar primeiro, o tema escuro ou claro?",
    "audio": "audio18",
    "Onde posso encontrar tutoriais sobre como usar a LINEX na IDE da Square Code?": "Temos uma biblioteca de tutoriais completa dentro da IDE! Para acessá-la, vá em 'Ajuda' e depois em 'Tutoriais Interativos'. Eles são perfeitos para te guiar, desde o básico até projetos mais avançados. Qual tema você gostaria de explorar hoje: a sintaxe da LINEX, como usar o depurador, ou a integração com o Square OS?",
    "audio": "audio19",
    "Quais são os atalhos de teclado mais úteis na IDE da Square Code?": "Os atalhos de teclado são a chave para a produtividade! Alguns dos mais úteis são `Ctrl + S` para salvar, `Ctrl + F` para buscar e `Ctrl + Shift + P` para abrir a paleta de comandos. Você já usa algum atalho no seu dia a dia? Qual você mais gostaria de aprender?",
    "audio": "audio20",
    "Preciso de ajuda com um erro de compilação no meu projeto LINEX.": "Ok, vamos resolver isso. Erros de compilação geralmente indicam um problema na sintaxe do seu código. Qual é a mensagem de erro que está aparecendo no terminal de saída? Se você puder me mostrar a linha de código onde o erro ocorre, eu posso te dar uma solução mais rápida.",
    "audio": "audio21",
    "Como eu faço para configurar um ambiente de desenvolvimento virtual no Square OS?": "Configurar um ambiente virtual é super importante para manter seus projetos isolados. No Square OS, você pode usar o comando `linex env create`. Isso cria um ambiente limpo, sem interferir com outras dependências. Você já sabe qual versão da LINEX ou quais bibliotecas você precisa para o seu ambiente?",
    "audio": "audio22",
    "O Square OS é compatível com outros programas que não sejam da Square Code?": "Sim, com certeza! Embora o Square OS seja otimizado para o ecossistema Square Code, ele é baseado em tecnologias abertas e pode executar a maioria dos aplicativos e ferramentas de desenvolvimento comuns. Você está pensando em usar algum software específico? Me diz qual é para eu checar a compatibilidade para você.",
    "audio": "audio23",
    "Quais são as melhores práticas para a escrita de código na LINEX?": "Excelente pergunta! As melhores práticas de código com a LINEX incluem o uso de nomes de variáveis claros, a modularização de funções e a adição de comentários para explicar partes complexas. Seguir essas práticas torna seu código mais fácil de ler e manter. Você tem algum projeto em andamento onde podemos aplicar essas dicas agora mesmo?",
    "audio": "audio24",
    "Como eu faço para otimizar o desempenho de um aplicativo mobile feito com LINEX?": "A otimização é um passo crucial para um aplicativo de sucesso. Para melhorar a performance, você pode focar em reduzir o número de requisições de rede, otimizar o carregamento de imagens e usar a cache da maneira correta. A LINEX já tem recursos embutidos para ajudar nisso. Quer que eu te mostre um exemplo de como usar a cache no seu código?",
    "audio": "audio25",
    "Qual é o futuro da LINEX e do ecossistema Square Code?": "O futuro é muito promissor! A equipe da Square Code está constantemente trabalhando em novas funcionalidades, como IA integrada, ferramentas de colaboração em tempo real e melhorias na performance. A ideia é que o ecossistema se torne ainda mais intuitivo e poderoso. Que tipo de funcionalidade você gostaria de ver na LINEX ou no Square OS no futuro?",
    "audio": "audio26",
    "Como eu faço para reportar um bug na IDE da Square Code?": "Sua ajuda é muito valiosa para nós! Para reportar um bug, você pode ir no menu de 'Ajuda' na IDE e selecionar a opção 'Reportar Bug'. Isso abrirá um formulário onde você pode descrever o problema em detalhes. Se você já tem um bug em mente, me conte sobre ele e eu posso te ajudar a descrevê-lo da melhor forma.",
    "audio": "audio27",
    "Existe algum recurso para iniciantes no Square OS?": "Sim, com certeza! O Square OS é projetado para ser amigável para iniciantes. A primeira coisa que você vê ao abrir é um painel de boas-vindas com links para os tutoriais e a documentação. Além disso, eu estou aqui para te ajudar em cada passo. O que você quer aprender primeiro?",
    "audio": "audio28",
    "Como eu faço para usar o terminal integrado do Square OS?": "O terminal é uma das ferramentas mais poderosas! Ele é acessível diretamente da IDE, e você pode usá-lo para executar comandos do sistema operacional, rodar o seu código LINEX e instalar dependências. Basta clicar no ícone do terminal na barra de ferramentas. Qual comando você gostaria de tentar primeiro?",
    "audio": "audio29",
    "É possível usar a LINEX para desenvolver jogos?": "Sim, é totalmente possível! A LINEX, combinada com bibliotecas gráficas específicas, pode ser usada para o desenvolvimento de jogos 2D e até mesmo 3D mais simples. A sua sintaxe limpa ajuda a focar na lógica do jogo. Você tem alguma ideia de jogo que gostaria de criar?",
    "audio": "audio30",
    "Como eu faço para criar testes automatizados no meu projeto LINEX?": "Testes automatizados são essenciais para garantir a qualidade do seu código. A LINEX tem um framework de testes embutido. Você pode criar arquivos de teste e usar comandos como `linex test` para rodar os testes e verificar se tudo está funcionando como deveria. Você já tem alguma função que gostaria de testar?",
    "audio": "audio31",
    "Qual a melhor forma de organizar as pastas do meu projeto no Square OS?": "Uma boa organização é a base de um projeto escalável. Uma abordagem comum é separar o código por funcionalidade. Por exemplo, ter uma pasta para 'componentes', outra para 'serviços' e outra para 'utilidades'. Você já tem uma ideia de como quer estruturar seu projeto? Podemos criar o esqueleto juntos.",
    "audio": "audio32",
    "Como eu faço para compartilhar meu projeto com um colega usando o Square OS?": "O Square OS torna a colaboração super fácil. Você pode simplesmente usar o sistema de controle de versão para 'dar um push' no seu projeto para um repositório remoto, como o Git. Seu colega pode então 'clonar' o projeto para a máquina dele. Quer que eu te ajude a configurar o seu primeiro repositório remoto?",
    "audio": "audio33",
    "Estou com um erro na minha função de loop, pode me ajudar?": "Claro! Erros em loops são bastante comuns. Qual o tipo de loop que você está usando (`for`, `while`)? E qual a mensagem de erro que aparece? Muitas vezes, o problema está na condição de parada ou na inicialização da variável. Me mostre um pedacinho do seu código e eu te ajudo a identificar.",
    "audio": "audio34",
    "Existe alguma ferramenta de design visual na IDE da Square Code para criar layouts de interface?": "A IDE da Square Code foca mais na escrita de código, mas ela tem suporte para a visualização de interfaces criadas com frameworks compatíveis. O melhor é criar a interface em um framework de UI e a IDE te ajudará a visualizar o resultado. Você já tem um framework de design em mente?",
    "audio": "audio35",
    "Como eu faço para criar um componente reutilizável em LINEX?": "Criar componentes reutilizáveis é uma das grandes vantagens da LINEX. Você pode encapsular um bloco de código em um arquivo separado e depois 'importá-lo' onde precisar. Isso ajuda a manter o código limpo e evita repetição. Quer que eu te mostre um exemplo de como criar um componente para um botão ou um cartão de usuário?",
    "audio": "audio36",
    "Qual é a diferença entre a LINEX e o Javascript?": "Essa é uma ótima comparação! A LINEX e o Javascript são diferentes na sua filosofia. Enquanto o Javascript é mais voltado para a web, a LINEX tem uma abordagem mais ampla e minimalista. A LINEX foi projetada para ser mais rápida e fácil de ler, enquanto o Javascript é mais flexível, mas pode ser complexo. Em qual área você pretende usar a LINEX?",
    "audio": "audio37",
    "É possível usar o Square OS sem internet?": "Sim, com certeza! A maioria das funcionalidades do Square OS e da IDE da Square Code funciona offline. Você pode continuar programando, executando, e salvando seus projetos normalmente. Você só precisará de internet para coisas como instalar novas dependências ou fazer 'push' em um repositório remoto. O que você quer fazer offline?",
    "audio": "audio38",
    "Como eu faço para criar um servidor web simples com LINEX?": "Criar um servidor web com a LINEX é super rápido e fácil. Você pode usar a biblioteca de rede nativa da LINEX para isso. O processo é basicamente: importar a biblioteca, definir uma porta, e criar uma função para lidar com as requisições. Quer que eu te mostre o código para um servidor simples que diz 'Olá, mundo!'?",
    "audio": "audio39",
    "Preciso de ajuda com a lógica do meu projeto, o código não está fazendo o que eu espero.": "Sem problemas, a lógica é o coração do projeto. O que exatamente você quer que o seu código faça? E o que ele está fazendo no momento? Se você me der uma ideia do seu objetivo e o trecho de código, eu posso te ajudar a identificar onde a lógica precisa ser ajustada.",
    "audio": "audio40",
    "Como eu faço para usar o depurador na IDE da Square Code?": "O depurador é uma das ferramentas mais importantes! Para usá-lo, você pode ir em 'Executar' e depois em 'Depurar'. Você pode então colocar 'breakpoints' nas linhas de código que você quer inspecionar. Quando o código rodar, ele vai parar nesses pontos para que você possa ver os valores das variáveis. Você já tem um ponto no seu código que gostaria de investigar?",
    "audio": "audio41",
    "Qual é o tipo de licença da LINEX e do Square OS?": "A LINEX e o Square OS são distribuídos sob licenças que incentivam o uso e a inovação. A LINEX é de código aberto, enquanto o Square OS tem uma licença que permite o uso pessoal e profissional. Para saber os detalhes exatos, você pode verificar a documentação de licença. Você está pensando em usar para um projeto comercial ou pessoal?",
    "audio": "audio42",
    "Como eu faço para atualizar a LINEX e o Square OS para a última versão?": "Manter tudo atualizado é crucial! O Square OS tem um sistema de atualização automático. Você pode ir em 'Configurações' e depois em 'Atualizações' para verificar se há uma nova versão. Para a LINEX, você pode usar o comando `linex update` no terminal para garantir que você tenha a versão mais recente. Qual versão você está usando agora?",
    "audio": "audio43",
    "Como eu faço para otimizar o tempo de carregamento do meu site feito com LINEX?": "A velocidade de carregamento é fundamental! Para otimizar, você pode focar em minificar os arquivos CSS e Javascript, usar a compressão de imagens e fazer o carregamento assíncrono. A LINEX já tem ferramentas que ajudam com isso. Quer que eu te mostre como usar o otimizador de arquivos da LINEX?",
    "audio": "audio44",
    "É possível usar a LINEX para desenvolver projetos de inteligência artificial?": "Sim, a LINEX pode ser usada para projetos de IA, especialmente para a parte de processamento de dados e a integração com modelos de IA. Embora não seja tão especializada como Python para IA, a sua performance e a sua sintaxe limpa a tornam uma ótima opção para tarefas de pré-processamento. Você já tem um projeto de IA em mente?",
    "audio": "audio45",
    "Qual a melhor forma de lidar com erros e exceções na LINEX?": "Tratamento de erros é uma parte crucial de um código robusto. A LINEX tem um sistema de tratamento de exceções com blocos `try-catch` e `finally`. Isso permite que você execute um código que pode falhar de forma segura. Você tem uma parte do código que costuma dar erro? Me mostre para eu te ajudar a tratá-la.",
    "audio": "audio46",
    "Como eu faço para usar a IDE da Square Code em modo de tela cheia?": "Modo de tela cheia é ótimo para foco total no código! Na IDE da Square Code, você pode usar o atalho `F11` para alternar para o modo de tela cheia. Isso esconde os menus e barras de ferramentas, te dando mais espaço para trabalhar. Você já tentou usar esse atalho?",
    "audio": "audio47",
    "É possível usar a LINEX para criar um aplicativo de desktop?": "Sim, é totalmente possível! A LINEX, combinada com bibliotecas específicas para interfaces de desktop, pode ser usada para criar aplicativos para Windows, macOS e Linux. Você já tem uma ideia de aplicativo de desktop que gostaria de construir? Por exemplo, um editor de texto, um cliente de chat, etc.",
    "audio": "audio48",
    "Como eu faço para configurar o tema escuro na IDE da Square Code?": "O tema escuro é o favorito de muita gente! Para ativá-lo, você pode ir em 'Configurações' e depois em 'Aparência'. Lá você vai encontrar uma opção para mudar o tema para 'Escuro'. Se você quiser, pode personalizar as cores também. Qual cor de destaque você gosta?",
    "audio": "audio49",
    "Onde posso encontrar a documentação da LINEX e do Square OS?": "A documentação é a sua melhor amiga! A documentação completa da LINEX e do Square OS está disponível online e também offline, dentro da própria IDE. Você pode acessá-la diretamente no menu 'Ajuda'. O que você gostaria de procurar na documentação hoje?",
    "audio": "audio50",
    "Preciso de ajuda para entender como funcionam as variáveis em LINEX.": "Claro! As variáveis na LINEX são bem intuitivas. Você as declara com a palavra-chave `var` ou `let` e atribui um valor. A principal diferença é que `var` pode ser redeclarada e `let` não, o que ajuda a evitar erros. Qual a sua primeira variável que você quer declarar? Talvez um nome, uma idade ou uma lista de itens?",
    "audio": "audio51",
    "Como eu faço para integrar a LINEX com um banco de dados?": "A integração com bancos de dados é uma das funcionalidades mais poderosas da LINEX. A LINEX tem bibliotecas nativas para se conectar com os bancos de dados mais comuns, como SQL e NoSQL. Você precisa primeiro instalar a biblioteca para o banco de dados que você quer usar e depois configurar a conexão. Qual banco de dados você quer usar?",
    "audio": "audio52",
    "Existe uma comunidade de desenvolvedores para LINEX e Square OS?": "Sim, com certeza! Temos uma comunidade online muito ativa e acolhedora. Você pode encontrar grupos em fóruns, redes sociais e até em eventos presenciais. É o lugar perfeito para fazer perguntas, compartilhar seus projetos e se conectar com outros desenvolvedores. Você já usa alguma rede social para programar?",
    "audio": "audio53",
    "Como eu faço para criar um teste de unidade para uma função na LINEX?": "Criar testes de unidade é essencial para a qualidade do código. Com a LINEX, você pode criar um arquivo de teste e usar o framework de testes para verificar se a saída de uma função é a que você espera. Quer que eu te mostre um exemplo de como testar uma função que soma dois números?",
    "audio": "audio54",
    "O que é a compilação 'on-the-fly' no Square OS?": "A compilação 'on-the-fly' é uma funcionalidade que torna o desenvolvimento mais rápido. Ela significa que o Square OS compila o seu código LINEX em tempo real, enquanto você está digitando, e te mostra os erros e avisos instantaneamente, sem que você precise rodar o compilador manualmente. Isso é super útil, não é?",
    "audio": "audio55",
    "Como eu faço para criar um componente de interface de usuário em LINEX?": "A criação de componentes de UI na LINEX é bem modular. Você pode criar um arquivo para o componente e usar a sintaxe de templates da LINEX para definir a sua estrutura e estilização. Isso permite que você o reutilize em várias partes do seu projeto. Que tipo de componente você gostaria de criar?",
    "audio": "audio56",
    "Qual a melhor forma de lidar com a segurança no meu projeto LINEX?": "Segurança é um tópico crucial! Para garantir a segurança, você pode usar as bibliotecas de criptografia e autenticação da LINEX, validar as entradas do usuário, e nunca armazenar senhas em texto claro. Você está preocupado com a segurança de um site, um aplicativo ou outra coisa?",
    "audio": "audio57",
    "Como eu faço para usar o sistema de 'live-preview' na IDE da Square Code?": "O 'live-preview' é uma funcionalidade incrível! Ele permite que você veja as alterações no seu código LINEX em tempo real, sem precisar recarregar a página. Para ativá-lo, você pode ir no menu de 'Visualização' e selecionar a opção 'Live Preview'. Você está trabalhando em um projeto de interface de usuário?",
    "audio": "audio58",
    "Preciso de ajuda para entender como funcionam as classes e objetos na LINEX.": "A LINEX tem uma abordagem um pouco diferente para classes e objetos, com um foco em protótipos e composição em vez de herança clássica. Isso oferece mais flexibilidade. Basicamente, você cria um 'objeto' e depois 'anexa' métodos e propriedades a ele. Você tem alguma ideia de um objeto que queira criar? Talvez um carro ou um usuário?",
    "audio": "audio59",
    "Qual a melhor forma de organizar o código de um aplicativo grande em LINEX?": "Em projetos grandes, a organização é a chave para o sucesso. Uma boa prática é usar o padrão de 'Módulos', onde você divide o seu código em pequenos arquivos com responsabilidades específicas. Você pode ter um módulo para as funções de UI, outro para a lógica do negócio, e assim por diante. Você já começou a escrever o código do seu aplicativo?",
    "audio": "audio60",
    "Como eu faço para usar as ferramentas de análise de código da IDE da Square Code?": "As ferramentas de análise de código são muito úteis! A IDE da Square Code vem com um linter e um formatador de código embutidos. Eles te ajudam a encontrar erros, seguir as melhores práticas e manter a formatação do seu código consistente. Você já tentou usar o formatador de código? O atalho é `Ctrl + Shift + F`.",
    "audio": "audio61"
}